# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of `JOIN` statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
* Write SQL queries that make use of various types of joins
* Compare and contrast the various types of joins
* Discuss how primary and foreign keys are used in SQL
* Decide and perform whichever type of join is best for retrieving desired data

## CRM Schema

In almost all cases, rather than just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins** using shared columns from the two tables. 

In this lab, you'll use the same customer relationship management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database `'data.sqlite'`.

In [1]:
# Your code here
import pandas as pd
import sqlite3

In [2]:
ls

README.md    data.sqlite  images/      index.ipynb  venn.png

In [3]:
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Display the names of all the employees in Boston 

Hint: join the employees and offices tables.

In [9]:
# Your code here
cur.execute('''
SELECT employees.firstName, employees.lastName
FROM employees
JOIN offices
ON employees.officeCode = offices.officeCode
WHERE offices.city = 'Boston'
''')
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df

  firstName   lastName
0     Julie   Firrelli
1     Steve  Patterson

## Are there any offices that have zero employees?
Hint: Combine the employees and offices tables and use a group by.

In [13]:
# Your code here
cur.execute('''
SELECT COUNT(employees.lastName), offices.officeCode, offices.city
FROM employees
JOIN offices
ON employees.officeCode = offices.officeCode
GROUP BY offices.officeCode
''')
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df

   COUNT(employees.lastName)  officeCode           city
0                          6           1  San Francisco
1                          2           2         Boston
2                          2           3            NYC
3                          5           4          Paris
4                          2           5          Tokyo
5                          4           6         Sydney
6                          2           7         London

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary
# Example: Display the htmlDescription and employee's first and last name for each product that each employee has sold
cur.execute('''
SELECT productlines.htmlDescription, employees
''')

In [ ]:
# Your code here

In [ ]:
# Your code here

In [ ]:
# Your code here

## Level Up: Display the names of every individual product that each employee has sold

In [14]:
# Your code here
cur.execute('''SELECT firstName, lastName, productName
                FROM employees e
                JOIN customers c
                ON e.employeeNumber = c.salesRepEmployeeNumber
                JOIN orders o
                USING (customerNumber)
                JOIN orderdetails od
                USING (orderNumber)
                JOIN products p
                USING (productCode)
                ''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
print(len(df))
df.head()

2996

  firstName  lastName                                  productName
0    Leslie  Jennings                               1958 Setra Bus
1    Leslie  Jennings                       1940 Ford Pickup Truck
2    Leslie  Jennings                      1939 Cadillac Limousine
3    Leslie  Jennings  1996 Peterbilt 379 Stake Bed with Outrigger
4    Leslie  Jennings                            1968 Ford Mustang

## Level Up: Display the Number of Products each employee has sold

In [15]:
# Your code here
cur.execute('''SELECT firstName, lastName, COUNT(productName)
                FROM employees e
                JOIN customers c
                ON e.employeeNumber = c.salesRepEmployeeNumber
                JOIN orders o
                USING(customerNumber)
                JOIN orderdetails od
                USING (orderNumber)
                JOIN products p
                USING (productCode)
                GROUP BY lastName
                ORDER BY firstName
                ''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
print(len(df))
df.head()

15

  firstName   lastName  COUNT(productName)
0      Andy     Fixter                 185
1     Barry      Jones                 220
2  Foon Yue      Tseng                 142
3    George     Vanauf                 211
4    Gerard  Hernandez                 396

## Summary

Congrats! You practiced using join statements and leveraged your foreign keys knowledge!